# 데이터 정제 및 준비

## 누락된 데이터 처리하기

In [1]:
import numpy as np
import pandas as pd

In [2]:
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### 누락된 데이터 골라내기

In [6]:
from numpy import nan as NA

In [7]:
data = pd.Series([1,NA,3.5,NA,7])

In [8]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA,NA,NA], [NA,6.5,3.]])

In [11]:
cleaned = data.dropna()

In [12]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [14]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data[4] = NA

In [16]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
df = pd.DataFrame(np.random.randn(7,3))

In [19]:
df.iloc[:4,1] = NA

In [20]:
df.iloc[:2,2] = NA

In [21]:
df

          0         1         2
0 -0.522966       NaN       NaN
1  1.943022       NaN       NaN
2 -1.093690       NaN -0.804742
3 -0.742376       NaN -0.739312
4  1.055882  1.604711  0.303234
5 -0.183530  0.895347  0.272917
6  0.545324 -1.679962 -1.585938

In [22]:
df.dropna()

          0         1         2
4  1.055882  1.604711  0.303234
5 -0.183530  0.895347  0.272917
6  0.545324 -1.679962 -1.585938

In [23]:
df.dropna(thresh=2)

          0         1         2
2 -1.093690       NaN -0.804742
3 -0.742376       NaN -0.739312
4  1.055882  1.604711  0.303234
5 -0.183530  0.895347  0.272917
6  0.545324 -1.679962 -1.585938

### 결측치 채우기

In [24]:
df.fillna(0)

          0         1         2
0 -0.522966  0.000000  0.000000
1  1.943022  0.000000  0.000000
2 -1.093690  0.000000 -0.804742
3 -0.742376  0.000000 -0.739312
4  1.055882  1.604711  0.303234
5 -0.183530  0.895347  0.272917
6  0.545324 -1.679962 -1.585938

In [25]:
df.fillna({1:0.5, 2:0})

          0         1         2
0 -0.522966  0.500000  0.000000
1  1.943022  0.500000  0.000000
2 -1.093690  0.500000 -0.804742
3 -0.742376  0.500000 -0.739312
4  1.055882  1.604711  0.303234
5 -0.183530  0.895347  0.272917
6  0.545324 -1.679962 -1.585938

In [26]:
_ = df.fillna(0, inplace=True)

In [27]:
df

          0         1         2
0 -0.522966  0.000000  0.000000
1  1.943022  0.000000  0.000000
2 -1.093690  0.000000 -0.804742
3 -0.742376  0.000000 -0.739312
4  1.055882  1.604711  0.303234
5 -0.183530  0.895347  0.272917
6  0.545324 -1.679962 -1.585938

In [28]:
df = pd.DataFrame(np.random.randn(6,3))

In [29]:
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA

In [30]:
df

          0         1         2
0 -0.104587  0.691924  0.363189
1  0.981279 -0.227114  0.610342
2 -1.156354       NaN -0.799504
3 -1.351077       NaN -0.745372
4  0.635787       NaN       NaN
5 -0.823760       NaN       NaN

In [31]:
df.fillna(method='ffill')

          0         1         2
0 -0.104587  0.691924  0.363189
1  0.981279 -0.227114  0.610342
2 -1.156354 -0.227114 -0.799504
3 -1.351077 -0.227114 -0.745372
4  0.635787 -0.227114 -0.745372
5 -0.823760 -0.227114 -0.745372

In [32]:
df.fillna(method = 'ffill',limit=2)

          0         1         2
0 -0.104587  0.691924  0.363189
1  0.981279 -0.227114  0.610342
2 -1.156354 -0.227114 -0.799504
3 -1.351077 -0.227114 -0.745372
4  0.635787       NaN -0.745372
5 -0.823760       NaN -0.745372

In [33]:
data = pd.Series([1.,NA,3.5,NA,7])

In [34]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 데이터 변형

### 중복 제거하기

In [35]:
data = pd.DataFrame({'k1':['one','two']*3 +['two'], 'k2':[1,1,2,3,3,4,4]})

In [36]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

#### 중복인 row를 확인 duplicated()

In [37]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

#### duplicated 에서 False인 값 return

In [39]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [40]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [41]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### 함수나 매핑을 이용해서 데이터 변형하기

In [42]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox'], 
                    'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [43]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [44]:
meat_to_animal = {
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pic',
    'nova lox':'salmon'
}

In [45]:
lowercased = data['food'].str.lower()

In [46]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [47]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pic
8     nova lox     6.0  salmon

In [48]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pic
8    salmon
Name: food, dtype: object

### 값 치환하기

In [49]:
data = pd.Series([1., -999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [50]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [51]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [52]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [53]:
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### 축 색인 이름 바꾸기

In [54]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index=['Ohio','Colorado','New York'],
                   columns=['one','two','three','four'])

In [55]:
transform = lambda x:x[:4].upper()

In [56]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [57]:
data.index = data.index.map(transform)

In [58]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [59]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11